import React, { useState } from "react";
import "./FAQSection.css";
import { ArrowUpRight } from 'lucide-react';
import { ArrowDownRight } from 'lucide-react';

const faqItems = [
    {
      id: 1,
      title: "НАВІЩО ВИВЧАТИ ЖЕСТОВУ МОВУ?",
      description: "Жестова мова — це візуальна мова для спілкування.",
      tasks: [
        {
          title: "Інклюзивність та допомога людям з порушеннями слуху",
          points: [
            "Жестова мова є одним із інструментів, який відіграє ключову роль у створенні інклюзивного суспільства. Вивчення жестової мови дає змогу спілкуватися з людьми, що повністю або частково втратили слух. Це питання  поваги та емпатії — знання навіть базових жестів допоможе таким людям почуватися повноцінною частиною суспільства. Особливо це актуально в умовах сьогодення, коли кількість українців з порушеннями слуху значно зросла через бойові дії, спричинені повномасштабним вторгненням рф."
          ]
        },
        {
          title: "Розширення комунікаційних можливостей",
          points: [
            "Жестова мова — це ще один спосіб передавати інформацію, особливо у надзвичайних ситуаціях, коли усна мова недоступна (наприклад, у шумному середовищі або під водою). Наразі діють обов'язкові експрес-курси для вивчення жестової мови для українських пожежників, рятувальників та інших працівників спеціальних служб."
          ]
        },
        {
          title: "Додавання нової навички у резюме",
          points: [
            "Знання жестової мови - це конкурентна перевага для педагогів, медиків, соціальних працівників, волонтерів, перекладачів, працівників сфери обслуговування. "
          ]
        }
        ,
        {
          title: "Підтримка близьких",
          points: [
            "Якщо в родині чи колі друзів є люди з вадами слуху, знання жестової мови — це необхідний засіб для спілкування та спосіб проявити турботу й любов."
          ]
        }
        ,
        {
          title: "Кар'єрні можливості",
          points: [
            "Переклад мовою жестів є окремим видом діяльності. Такі фахівці викладають жестову мову, супроводжують новини, конференції, концерти, судові засідання. Це затребувана і важлива професія. "
          ]
        }
        ,
        {
          title: "Новий метод тренування пам’яті",
          points: [
            "Вчені довели, що вивчення жестової мови тренує зорову пам’ять, увагу, реакцію та просторове мислення, а також допомагає активізувати моторику пальців."
          ]
        }
        
      ]
    },
    {
      id: 2,
      title: "У ВСІХ КРАЇНАХ ДІЄ ЄДИНА ЖЕСТОВА МОВА?",
      description: "Жестова мова відрізняється між країнами.",
      tasks: [
        {
          title: "Ні, у світі є багато жестових мов.",
          points: [
            "У світі за різними джерелами є близько 150-300 різних жестових мов, тому, вивчивши одну, не слід чекати, що вас зрозуміють носії іншої. Кожна жестова мова має свою граматику та лексику. Українська жестова мова є невіддільною частиною національної культури та ідентичності, право на її вільне використання та вивчення закріплене у Конституції України. Особливісю УЖМ є використання не лише рук, але й міміки, положення тіла, рухів голови та очей для передачі інформації. Важливу роль відіграє й простір перед тілом." ,
            "Окрім того, існує міжнародна жестова мова. Вона має менший обсяг жестів і використовується здебільшого у сфері політики та науки."
          ]
        }
      ]
    }
    ,
    {
      id: 3,
      title: "ОПАНУВАТИ ЖЕСТОВУ МОВУ СКЛАДНО?",
      description: "Жестова мова відрізняється між країнами.",
      tasks: [
        {
          title: "Ця мета потребує часу та зусиль, проте є цілком досяжною",
          points: [
            "Як і для вивчення будь-якої мови, потребен час, практика, зусилля та бажання. Важливо розуміти, що жестова мова — це не просто набір жестів, а повноцінна система з власними граматикою та синтаксисом. Проте цей виклик є цілком посильним. Вивчення жестової мови починається з дактилю. Це допоміжна система, в якій кожному жесту однієї руки відповідає літера української мови. Знаючи дактиль, можна передавати значення будь-яких слів, імен, термінів або навіть тих понять, для яких ще не визначено окремі жести. Вивчення дактилю займає небагато часу, жести є інтуїтивно зрозумілими, оскільки більшість з них нагадує форму відповідних літер."
          ]
        }
      ]
    }
  ];
  
export default function FAQSection() {
  const [openIndex, setOpenIndex] = useState(null);

  const toggle = (index) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  return (
    <section className="faq-section">
      <div className="faq-overlay" />
      <div className="faq-container">
        <div className="faq-header">
        <div className="title-wrapper">
          <h2>ДІЗНАЙСЯ БІЛЬШЕ ПРО ЖЕСТОВУ МОВУ</h2>
          </div>
          <div className="subtext-wrapper">
          <p className="faq-subtext">
          Жестова мова (ЖМ) — самостійна мова, яка складається з комбінації жестів руками в поєднанні з мімікою та артикуляцією губ. ЖМ є основною або єдиною мовою спілкування для людей з певними порушеннями слуху.   </p>
          </div>
        
        </div>

        <div className="faq-list">
          {faqItems.map((item, index) => (
            <div
              key={item.id}
              className={`faq-item ${openIndex === index ? "open" : ""}`}
              onClick={() => toggle(index)}
            >
              <div className="faq-title">
              <span className="faq-index">[ 0{ item.id} ]</span>
                <span>{item.title}</span>
                {openIndex === index ? (
  <ArrowUpRight className="faq-arrow up" size={49} />
) : (
  <ArrowDownRight className="faq-arrow" size={49} />
)}
              </div>
           
              {openIndex === index && (
  <div>  
    {openIndex === index && (
  <div className="faq-task-block-wrapper">
    {item.tasks.map((taskBlock, groupIndex) => (
      <div className="faq-task-block" key={groupIndex}>
        <p className="faq-task-title">{taskBlock.title}</p>
        {taskBlock.points.map((task, taskIndex) => (
          <p key={taskIndex} className="faq-task-text">{task}</p>
        ))}
      </div>
    ))}
  </div>
)}
  </div>
)}
            </div>
          ))}
        </div>
      </div>
    </section>
  );
}